let content = [
  /* ==============================================================================================

  ページジャンプと目次を自動生成するために必要な情報なので追加していってください
  [*][0]に大見出し、[*][1~]に中見出し

  ---------------------------------------------------------------------------------------------- */

  ["0話:イントロダクション", "同好会へようこそ！", "Javaについて"],
  ["1話:プログラムの実行", "VSCodeの使い方", "Javaの基本", "プログラムの実行"],
  ["2話:", "～鋭意製作中～"],
  ["3話:", "～鋭意製作中～"],
  ["4話:", "～鋭意製作中～"],
  ["5話:", "～鋭意製作中～"],
  ["6話:", "～鋭意製作中～"],
  ["7話:", "～鋭意製作中～"],
  ["8話:", "～鋭意製作中～"],
  ["9話:", "～鋭意製作中～"],
  ["10話:", "～鋭意製作中～"],
  ["11話:", "～鋭意製作中～"],
  ["12話:", "～鋭意製作中～"],

  /* =========================================================================================== */
];
let content2 = [
  ["環境構築編", "JDKとVSCode"],
  ["番外編", "別言語,GitHub,プレゼン資料"],
  ["編集者へ", "編集指南書"],
];
let txt =
  "<div class=headerLeft><a href='index.html'><img class=logo src='logo.png' alt='ロゴ'></a></div><div class=headerCenterLeft><a href='environment.html'>MyPCを持っている子は<br>こちら(環境構築編)</a></div><div class=headerCenterRight><a href='another.html'>別のことがしたい子は<br>こちら(番外編)</a></div><div class=headerRight><a href='developer.html'>デベロッパーへ</a></div>";
let all = "";
header.innerHTML = txt;
